knellen_project/app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = $1 LIMIT 1  [["user_id", 4]]
---
def index
 @current_user = User.find_by(session[:user_id])