knellen_project/app/controllers/sessions_controller.rb

def create
User.create(uname: params[:signup][:uname] ,password: params[:signup][:password],
            fname: params[:signup][:fname] ,lname: params[:signup][:lname] ,
            email: params[:signup][:email] ,phone: params[:signup][:phone] ,  )
---
INSERT INTO "users" ("uname", "password_digest", "fname", "lname", "email", "phone") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "user_id"  [["uname", "test"], ["password_digest", "$2a$10$SGqknorayrHhh02kfHv1r.sjd1SONuhbhC8FUvNDYOHzaXtVQiKjy"], ["fname", "test"], ["lname", "test"], ["email", "asdasd@test.com"], ["phone", "0.0"]]

def login
user = User.find_by(uname: params[:session][:uname])
---
SELECT  "users".* FROM "users" WHERE "users"."uname" = $1 LIMIT 1  [["uname", "test"]]