app/controllers/posts_controller.rb

	def index
      @post = Post.all
---
SELECT "posts".* FROM "posts"

  def create
      Post.create(title: params[:create][:title],
        content: params[:create][:content],
        user_id: current_user.id)
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test again"], ["content", "test"], ["user_id", 1], ["created_at", "2015-02-21 19:28:59.100071"], ["updated_at", "2015-02-21 19:28:59.100071"]]