app/controllers/sessions_controller.rb

  def create
  	user = User.find_by(uname: params[:session][:uname])
---
SELECT  "users".* FROM "users" WHERE "users"."uname" = $1 LIMIT 1  [["uname", "test"]]